RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_seglcd.c
/***************************************************************************//**
* \file cy_seglcd.c
* \version 1.10
*
* \brief
* Provides an API implementation of the SegLCD driver
*
********************************************************************************
* \copyright
* Copyright 2019-2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXLCD)

#include "cy_seglcd.h"
#include "cy_sysclk.h"

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.3', 28, \
'LCD_Type will typecast to either LCD_V1_Type or LCD_V2_Type but not both on PDL initialization based on the target device at compile time.');

#define CY_SEGLCD_ENABLE_Msk                (LCD_CONTROL_LS_EN_Msk | LCD_CONTROL_HS_EN_Msk)
#define CY_SEGLCD_NIBBLE                    (4UL)

#define CY_SEGLCD_DIV_MAX                   (0x0000FFFFUL) /* The max. divider values */
#define CY_SEGLCD_DIV_MAX_LS_VER1           (0x000000FFUL) /* The max. divider values for Low Speed mode for MXLCD_ver1 */

#define CY_SEGLCD_SYM_BIT_IDX_Pos           (0U)
#define CY_SEGLCD_SYM_BIT_IDX_Msk           ((uint32_t) 0x00000007UL << CY_SEGLCD_SYM_BIT_IDX_Pos)
#define CY_SEGLCD_SYM_BYTE_IDX_Pos          (3U)
#define CY_SEGLCD_SYM_BYTE_IDX_Msk          ((uint32_t) 0x00001FFFUL << CY_SEGLCD_SYM_BYTE_IDX_Pos)

#define CY_SEGLCD_PIX_Pos(pixel)            ((CY_SEGLCD_EXTR_NBL(pixel) * CY_SEGLCD_NIBBLE) + \
                                             (CY_SEGLCD_EXTR_COM(pixel) % CY_SEGLCD_NIBBLE))
#define CY_SEGLCD_PIX_Msk(pixel)            ((uint32_t)(1UL << CY_SEGLCD_PIX_Pos(pixel)))

#define CY_SEGLCD_REVISION(base)            (_FLD2VAL(LCD_ID_REVISION, LCD_ID(base)))
#define CY_SEGLCD_REV_1(base)               (1UL == CY_SEGLCD_REVISION(base))
#define CY_SEGLCD_IS_ENABLED(base)          (0UL != (LCD_CONTROL(base) & CY_SEGLCD_ENABLE_Msk))
#define CY_SEGLCD_IS_MSK_VALID(pixel)       (0UL == ((pixel) & ~(CY_SEGLCD_COM_Msk | CY_SEGLCD_OCT_Msk | CY_SEGLCD_NBL_Msk)))
#define CY_SEGLCD_IS_COM_VALID(pixel)       (LCD_COM_NUM > CY_SEGLCD_EXTR_COM(pixel))
#define CY_SEGLCD_IS_PIX_VALID(pixel)       (CY_SEGLCD_IS_MSK_VALID(pixel) && CY_SEGLCD_IS_COM_VALID(pixel))


#define CY_SEGLCD_COM_NUM_MIN               (2U)
#define CY_SEGLCD_COM_NUM_MAX               (LCD_COM_NUM)
#define CY_SEGLCD_IS_COM_NUM_VALID(num)     ((CY_SEGLCD_COM_NUM_MIN <= (num)) && ((num) <= CY_SEGLCD_COM_NUM_MAX))

#define CY_SEGLCD_IS_BASIC(type)            (((uint16_t)CY_SEGLCD_7SEG  == (type)) || \
                                             ((uint16_t)CY_SEGLCD_14SEG == (type)) || \
                                             ((uint16_t)CY_SEGLCD_16SEG == (type)) || \
                                             ((uint16_t)CY_SEGLCD_5X8DM == (type)))

#define CY_SEGLCD_IS_PIXMAP(disp)           ((NULL != (disp)) && \
                                             (NULL != (disp)->pixMap))

#define CY_SEGLCD_IS_SYMBOLIC(disp, pos)    (CY_SEGLCD_IS_PIXMAP(disp) && \
                                             (NULL != (disp)->font) && \
                                             (NULL != (disp)->font->fontMap) && \
                                             ((uint32_t)CY_SEGLCD_BAR < (disp)->type) && \
                                             (((pos) < (disp)->symNum)))

#define CY_SEGLCD_IS_ASCII(disp, pos)       (CY_SEGLCD_IS_SYMBOLIC(disp, pos) && \
                                             ((disp)->font->ascii))

#define CY_SEGLCD_IS_BARGRAPH(disp, pos)    (CY_SEGLCD_IS_PIXMAP(disp) && \
                                             ((uint32_t)CY_SEGLCD_BAR == (disp)->type) && \
                                             (((pos) < (disp)->symNum)))

#define CY_SEGLCD_IS_SPEED_VALID(speed)     ((CY_SEGLCD_SPEED_LOW  == (speed)) || \
                                             (CY_SEGLCD_SPEED_HIGH == (speed)))

#define CY_SEGLCD_IS_WAVE_VALID(wave)       ((CY_SEGLCD_TYPE_A == (wave)) || \
                                             (CY_SEGLCD_TYPE_B == (wave)))

#define CY_SEGLCD_IS_DRIVE_VALID(drive)     ((CY_SEGLCD_PWM         == (drive)) || \
                                             (CY_SEGLCD_CORRELATION == (drive)))

#define CY_SEGLCD_IS_BIAS_4_5_SUPPORTED(base,speed) ((CY_SEGLCD_REV_1(base)) ? (CY_SEGLCD_SPEED_HIGH == (speed)) : true)

#define CY_SEGLCD_IS_BIAS_VALID(base,bias,speed) ((CY_SEGLCD_BIAS_HALF   == (bias))  || \
                                                  (CY_SEGLCD_BIAS_THIRD  == (bias))  || \
  (CY_SEGLCD_IS_BIAS_4_5_SUPPORTED(base,speed) && (CY_SEGLCD_BIAS_FOURTH == (bias))) || \
  (CY_SEGLCD_IS_BIAS_4_5_SUPPORTED(base,speed) && (CY_SEGLCD_BIAS_FIFTH  == (bias))))

#define CY_SEGLCD_IS_LSCLK_VALID(lsClk)     ((CY_SEGLCD_LSCLK_LF == (lsClk)) || \
                                             (CY_SEGLCD_LSCLK_MF == (lsClk)))

#define CY_SEGLCD_FR_RATE_MIN               (30U)
#define CY_SEGLCD_FR_RATE_MAX               (150U)
#define CY_SEGLCD_IS_RATE_VALID(frRate)     (((frRate) >= CY_SEGLCD_FR_RATE_MIN) && ((frRate) <= CY_SEGLCD_FR_RATE_MAX))

#define CY_SEGLCD_CNTR_MAX                  (100UL)
#define CY_SEGLCD_IS_CNTR_VALID(contrast)   (((uint32_t)(contrast)) <= CY_SEGLCD_CNTR_MAX)

#define CY_SEGLCD_FREQ_MIN                  (10000UL)
#define CY_SEGLCD_FREQ_MAX                  (100000000UL)
#define CY_SEGLCD_IS_FREQ_VALID(freq)       (((freq) >= CY_SEGLCD_FREQ_MIN) && ((freq) <= CY_SEGLCD_FREQ_MAX))

#define CY_SEGLCD_SPACE(disp)               (((disp)->font->ascii) ? ' ' : CY_SEGLCD_NUM_BLANK)

/* The timeout value for Low Speed mode enable/disable procedures, two ILO clock periods, in uSeconds */
#define CY_SEGLCD_TIMEOUT ((2U * 1000000UL) / CY_SYSCLK_ILO_FREQ)


static volatile uint32_t * GetDataRegPtr(LCD_Type * base, uint32_t pixel);
static void InvClrData(LCD_Type * base, bool inv);
static char_t NumToChar(uint32_t value);


