RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_seglcd.c
/*******************************************************************************
* Function Name: Cy_SegLCD_Contrast
****************************************************************************//**
*
* Sets a specified contrast.
*
* \param base   The base pointer to the LCD instance registers.
* \param contrast The contrast value to be set.
* \param config The pointer to a configuration structure.
* \return \ref cy_en_seglcd_status_t.
*
* Side Effects: The configuration structure contrast value is also updated.
*
* \funcusage
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_ContrastInit
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_Contrast
*
*******************************************************************************/
cy_en_seglcd_status_t Cy_SegLCD_Contrast(LCD_Type * base, uint32_t contrast, cy_stc_seglcd_config_t * config)
{
    cy_en_seglcd_status_t retVal = CY_SEGLCD_BAD_PARAM;

    if (CY_SEGLCD_IS_CNTR_VALID (contrast))
    {
        bool enabled = CY_SEGLCD_IS_ENABLED(base); /* Store the block state */

        config->contrast = (uint8_t)contrast;

        retVal = Cy_SegLCD_Init(base, config);

        if ((CY_SEGLCD_SUCCESS == retVal) && enabled)
        {
            Cy_SegLCD_Enable(base); /* Restore the block state */
        }
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SegLCD_Deinit
****************************************************************************//**
*
* De-initializes the LCD block (resets the block registers to default state).
*
* \param base   The base pointer to the LCD instance registers.
*
* \funcusage
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_Deinit
*
*******************************************************************************/
void Cy_SegLCD_Deinit(LCD_Type * base)
{
    Cy_SegLCD_Disable(base);

    LCD_CONTROL(base) = 0UL;
    LCD_DIVIDER(base) = 0UL;

    InvClrData(base, false); /* Clear the entire frame buffer to all zeroes */
}


/*******************************************************************************
* Function Name: Cy_SegLCD_Enable
****************************************************************************//**
*
* Enables the Segment LCD block.
*
* \param base The base pointer to the LCD instance registers.
*
* \funcusage
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_Config
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_Init
*
*******************************************************************************/
void Cy_SegLCD_Enable(LCD_Type * base)
{
    if (_FLD2BOOL(LCD_CONTROL_LCD_MODE, LCD_CONTROL(base)))
    {
        LCD_CONTROL(base) |= LCD_CONTROL_HS_EN_Msk;
    }
    else /* CY_SEGLCD_SPEED_HIGH */
    {
        uint32_t timeout;

        LCD_CONTROL(base) |= LCD_CONTROL_LS_EN_Msk;

        for (timeout = CY_SEGLCD_TIMEOUT; (_FLD2BOOL(LCD_CONTROL_LS_EN_STAT, LCD_CONTROL(base))) && (0UL != timeout); timeout--)
        {
            /* Waiting for enabling takes effect in the ILO clock domain.
             * The timeout status does not affect anything,
             * the timeout is to avoid a deadlock here.
             */
            Cy_SysLib_DelayUs(1U);
        }
    }
}


/*******************************************************************************
* Function Name: Cy_SegLCD_Disable
****************************************************************************//**
*
* Disables the Segment LCD block.
*
* \param base The base pointer to the LCD instance registers.
*
* \funcusage
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_Disable
*
*******************************************************************************/
void Cy_SegLCD_Disable(LCD_Type * base)
{
    if (_FLD2BOOL(LCD_CONTROL_LCD_MODE, LCD_CONTROL(base))) /* CY_SEGLCD_SPEED_HIGH */
    {
        LCD_CONTROL(base) &= ~LCD_CONTROL_HS_EN_Msk;
    }
    else /* CY_SEGLCD_SPEED_LOW */
    {
        if (_FLD2BOOL(LCD_CONTROL_LS_EN, LCD_CONTROL(base)))
        {
            uint32_t timeout;

            for (timeout = CY_SEGLCD_TIMEOUT; (!_FLD2BOOL(LCD_CONTROL_LS_EN_STAT, LCD_CONTROL(base))) && (0UL != timeout); timeout--)
            {
                 Cy_SysLib_DelayUs(1U); /* Waiting for enabling takes effect in the ILO clock domain. */
            }

            LCD_CONTROL(base) &= ~LCD_CONTROL_LS_EN_Msk;

            for (timeout = CY_SEGLCD_TIMEOUT; (_FLD2BOOL(LCD_CONTROL_LS_EN_STAT, LCD_CONTROL(base))) && (0UL != timeout); timeout--)
            {
                Cy_SysLib_DelayUs(1U); /* Waiting for disabling takes effect in the ILO clock domain. */
            }

            /* The timeout status does not affect anything, the timeout is to avoid a deadlock */
        }
    }
}


/*******************************************************************************
* Function Name: Cy_SegLCD_ClrFrame
****************************************************************************//**
*
* Clears the frame buffer and initiates the common lines.
* In general case it is recommended to be called after \ref Cy_SegLCD_Init
*                                           and before \ref Cy_SegLCD_Enable.
*
* \param base    The base pointer to the LCD instance registers.
* \param commons The pointer to array of common lines.
*                The array size is specified by \ref cy_stc_seglcd_config_t.comNum.
*                Each common line value should be made using
*                \ref CY_SEGLCD_COMMON macro.
*
* \return \ref cy_en_seglcd_status_t.
*
* \funcusage
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_Config
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_Init
*
*******************************************************************************/
cy_en_seglcd_status_t Cy_SegLCD_ClrFrame(LCD_Type * base, uint32_t const * commons)
{
    uint32_t retVal = (uint32_t)CY_SEGLCD_BAD_PARAM;

    if (NULL != commons)
    {
        uint32_t i;

        InvClrData(base, false); /* Clear the entire frame buffer to all zeroes */

        retVal = (uint32_t)CY_SEGLCD_SUCCESS;

        /* Re-initialize the commons */
        for (i = 0UL; i < CY_SEGLCD_COM_NUM(base); i++)
        {
            retVal |= (uint32_t)Cy_SegLCD_WritePixel(base, commons[i], true);
        }
    }

