RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_seglcd.c
    return((cy_en_seglcd_status_t)retVal);
}


/*******************************************************************************
* Function Name: Cy_SegLCD_InvFrame
****************************************************************************//**
*
* Inverts the frame buffer (all the connected pixel states are inverted).
*
* \param base    The base pointer to the LCD instance registers.
* \param commons The pointer to an array of common lines.
*                The array size is specified by \ref cy_stc_seglcd_config_t.comNum.
*                Each common line value should be made using
*                \ref CY_SEGLCD_COMMON macro.
*
* \return \ref cy_en_seglcd_status_t.
*
* \funcusage
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_InvFrame
*
*******************************************************************************/
cy_en_seglcd_status_t Cy_SegLCD_InvFrame(LCD_Type * base, uint32_t const * commons)
{
    uint32_t retVal = (uint32_t)CY_SEGLCD_BAD_PARAM;

    if (NULL != commons)
    {
        uint32_t i;

        InvClrData(base, true); /* Invert the entire frame buffer. */

        retVal = (uint32_t)CY_SEGLCD_SUCCESS;

        /* Re-initialize the common lines */
        for (i = 0UL; i < CY_SEGLCD_COM_NUM(base); i++)
        {
            uint32_t locCom = commons[i] & ~CY_SEGLCD_COM_Msk;
            uint32_t j = 0UL;

            /* Clear common lines data after frame buffer inverting */
            for (j = 0UL; j < CY_SEGLCD_COM_NUM(base); j++)
            {
                retVal |= (uint32_t)Cy_SegLCD_WritePixel(base, locCom | ((uint32_t)(j << CY_SEGLCD_COM_Pos)), false);
            }

            /* Set data for the common lines */
            retVal |= (uint32_t)Cy_SegLCD_WritePixel(base, commons[i], true);
        }
    }

    return((cy_en_seglcd_status_t)retVal);
}


/*******************************************************************************
* Function Name: Cy_SegLCD_WritePixel
****************************************************************************//**
*
*  Sets or clears a specified pixel.
*
* \param base The base pointer to the LCD instance registers.
* \param pixel The predefined packed number that points to the pixel location
*              in the frame buffer.
* \param value Specifies the pixel on/off state.
* \return \ref cy_en_seglcd_status_t.
*
* \funcusage
* \snippet seglcd/snippet/SegLCD_Snpt.h snippet_Cy_SegLCD_DefPixel
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_ActPixel
*
*******************************************************************************/
cy_en_seglcd_status_t Cy_SegLCD_WritePixel(LCD_Type * base, uint32_t pixel, bool value)
{
    cy_en_seglcd_status_t retVal = CY_SEGLCD_BAD_PIXEL;

    if (CY_SEGLCD_IS_PIX_VALID(pixel))
    {
        /* Extract the pixel location. */
        uint32_t loc_Pos = CY_SEGLCD_PIX_Pos(pixel);
        uint32_t loc_Msk = CY_SEGLCD_PIX_Msk(pixel);

        /* Write a new pixel value into the frame buffer. */
        CY_REG32_CLR_SET(*GetDataRegPtr(base, pixel), loc, value ? 1UL : 0UL);

        retVal = CY_SEGLCD_SUCCESS;
    }

    return(retVal);
}


/*******************************************************************************
* Function Name: Cy_SegLCD_ReadPixel
****************************************************************************//**
*
* Gets the state of a specified pixel.
*
* \param base The base pointer to the LCD instance registers.
* \param pixel The predefined packed number that points to the pixel location
*              in the frame buffer. Each pixel value should be made using
*              \ref CY_SEGLCD_PIXEL macro.
* \return Boolean pixel state.
*         If pixel value is invalid - the 'false' is returned.
*
* \funcusage
* \snippet seglcd/snippet/SegLCD_Snpt.h snippet_Cy_SegLCD_DefPixel
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_ActPixel
*
*******************************************************************************/
bool Cy_SegLCD_ReadPixel(LCD_Type * base, uint32_t pixel)
{
    bool retVal = false;

    if (CY_SEGLCD_IS_PIX_VALID(pixel))
    {
        /* Get the pixel value from the frame buffer */
        retVal = (0UL != (*GetDataRegPtr(base, pixel) & CY_SEGLCD_PIX_Msk(pixel)));
    }
    else
    {
        CY_ASSERT_L1(false);
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SegLCD_WriteChar
****************************************************************************//**
*
* Writes a specified character onto a specified display.
* Supports all display types except \ref CY_SEGLCD_BAR.
*
* \param base The base pointer to the LCD instance registers.
* \param character The code of the character to display.
*                  Should be within the font symbol codes range specified by
*           \ref cy_stc_seglcd_font_t.first and \ref cy_stc_seglcd_font_t.last
* \param position The position of the character/digit on display.
*                 Zero is the most left character/digit of the specified
*                 display \ref cy_stc_seglcd_disp_t.
* \param display The pointer to the display structure \ref cy_stc_seglcd_disp_t.
* \return \ref cy_en_seglcd_status_t.
*
* \funcusage
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_Char
*
*******************************************************************************/
cy_en_seglcd_status_t Cy_SegLCD_WriteChar(LCD_Type * base,
                                            char_t   character,
                                          uint32_t   position,
                        cy_stc_seglcd_disp_t const * display)
{
    uint32_t retVal = (uint32_t)CY_SEGLCD_BAD_PARAM;

    if (CY_SEGLCD_IS_SYMBOLIC(display, position)) /* If the display is symbolic/numeric */
    {
        uint32_t i;
        uint32_t locChar = (uint32_t)character;
        retVal = CY_SEGLCD_IS_BASIC(display->type) ? (uint32_t)CY_SEGLCD_SUCCESS : (uint32_t)CY_SEGLCD_CUSTOM;

        if ((character < display->font->first) || (character > display->font->last)) /* if out of the font range */
        {
            retVal |= (uint32_t)CY_SEGLCD_BAD_CHAR;
            locChar = (uint32_t)CY_SEGLCD_SPACE(display); /* The blank (space) character */
        }

        locChar = (uint32_t)(locChar - (uint32_t)display->font->first); /* Shift to the font char map starting index */

        for (i = 0UL; i < (uint32_t)display->type; i++)
        {
            uint32_t locPix = *(display->pixMap + (position * (uint32_t)display->type) + i); /* Current display pixel */
            uint32_t locIdx = _FLD2VAL(CY_SEGLCD_SYM_BYTE_IDX, i) + (locChar * CY_SYSLIB_DIV_ROUNDUP((uint32_t)display->type, CY_SEGLCD_OCTET)); /* current symbol byte index */
            bool     locVal = 0U != (display->font->fontMap[locIdx] & (uint8_t)(1U << _FLD2VAL(CY_SEGLCD_SYM_BIT_IDX, i))); /* current pixel value */

