RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_seglcd.c
            retVal |= (uint32_t)Cy_SegLCD_WritePixel(base, locPix, display->invert != locVal);
        }
    }

    return((cy_en_seglcd_status_t)retVal);
}


/*******************************************************************************
* Function Name: Cy_SegLCD_WriteNumber
****************************************************************************//**
*
* Displays an integer value onto a specified display.
* Supports all display types except \ref CY_SEGLCD_BAR.
*
* \note The sign conversion, sign display, decimal points, and other special segments
*       outside the display symbols themselves should be handled on upper layer code.
*
* \param base The base pointer to the LCD instance registers.
* \param value The unsigned integer number to be displayed.
* \param position The position of the least significant digit of the number
*        as counted left to right starting at 0 - the first symbol on the left
*        of the specified display.
*        If the specified display contains fewer symbols than the number
*        requires to be displayed, the extra (more significant) digit(s) is(are) not
*        displayed and the \ref CY_SEGLCD_EXCEED value is returned.
* \param display The pointer to the display structure \ref cy_stc_seglcd_disp_t.
* \param zeroes:
*    - true - all the unused digits on the left of the displayed value are zeroes.
*    - false - all the above mentioned digits are blank.
* \param hex:
*    - true - the value is displayed in the hexadecimal format.
*    - false - the value is displayed in the decimal format.
* \return \ref cy_en_seglcd_status_t.
*
* \funcusage
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_DecNum
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_HexNum
*
*******************************************************************************/
cy_en_seglcd_status_t Cy_SegLCD_WriteNumber(LCD_Type * base,
                                            uint32_t   value,
                                            uint32_t   position,
                          cy_stc_seglcd_disp_t const * display,
                                                bool   zeroes,
                                                bool   hex)
{
    uint32_t retVal = (uint32_t)CY_SEGLCD_BAD_PARAM;

    if (CY_SEGLCD_IS_SYMBOLIC(display, position)) /* If the display is symbolic/numeric */
    {
        uint32_t locNum;
        uint32_t i = position + 1UL;
        uint32_t locDiv = (hex) ? 0x10UL : 10UL; /* The digit weight for hex/dec counting systems */
        retVal = (uint32_t)CY_SEGLCD_SUCCESS;

        do
        {
            i--;

            if ((0UL == value) && (i != position) && (!zeroes))
            {
                /* For 'not zeroes' mode each extra digit is cleared. */
                locNum = (uint32_t)CY_SEGLCD_NUM_BLANK;
            }
            else
            {
                /* Display the subsequent digit or '0' for 'zeroes' mode */
                locNum = value % locDiv;
            }

            /* Calculate the next digit value */
            value = value / locDiv;

            retVal |= (uint32_t)Cy_SegLCD_WriteChar(base, (display->font->ascii) ? NumToChar(locNum) : (char_t)locNum, i, display);
        }
        while (i != 0UL); /* While the current digit position is in the range of the display, keep processing the output */

        if (0UL != value)
        {
            retVal |= (uint32_t)CY_SEGLCD_EXCEED;
        }
    }

    return((cy_en_seglcd_status_t)retVal);
}


/*******************************************************************************
* Function Name: Cy_SegLCD_WriteString
****************************************************************************//**
*
* Writes a specified zero-terminated char string onto a specified display.
* Supports all display types except \ref CY_SEGLCD_BAR.
*
* \param base The base pointer to the LCD instance registers.
* \param string The pointer to the ASCII-coded null-terminated character string.
* \param position The position of the first string character at the display
*        as counted left to right starting at 0 - the first symbol on the left
*        of the specified display.
*        If the specified display contains fewer symbols than the string
*        requires to be displayed, the extra character(s) is(are) not displayed
*        and the \ref CY_SEGLCD_EXCEED value is returned.
* \param display The pointer to the display structure \ref cy_stc_seglcd_disp_t.
* \return \ref cy_en_seglcd_status_t.
*
* \funcusage
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_String
*
*******************************************************************************/
cy_en_seglcd_status_t Cy_SegLCD_WriteString(LCD_Type * base,
                                        char_t const * string,
                                            uint32_t   position,
                          cy_stc_seglcd_disp_t const * display)
{
    uint32_t retVal = (uint32_t)CY_SEGLCD_BAD_PARAM;

    if (CY_SEGLCD_IS_ASCII(display, position)) /* If the display is symbolic/numeric and the font is ASCII-coded */
    {
        uint32_t i;
        retVal = (uint32_t)CY_SEGLCD_SUCCESS;

        for (i = 0UL; (i + position) < display->symNum; i++)
        {
            retVal |= (uint32_t)Cy_SegLCD_WriteChar(base, ('\0' != string[i]) ? string[i] : CY_SEGLCD_SPACE(display), i + position, display);
        }

        if ('\0' != string[i])
        {
            retVal |= (uint32_t)CY_SEGLCD_EXCEED;
        }
    }

    return((cy_en_seglcd_status_t)retVal);
}


/*******************************************************************************
* Function Name: Cy_SegLCD_BarGraph
****************************************************************************//**
*
* Draws a bar onto a specified bar graph / dial display.
* Only the \ref CY_SEGLCD_BAR display type is supported.
*
* \param base The base pointer to the LCD instance registers.
* \param value The length of the bar in pixels.
* \param position The position of the first bar pixel as counted from the
*        beginning ('0' is the first pixel) of the specified display.
*        If the specified display contains fewer pixels than the bar
*        requires to be displayed, the extra pixel(s) is(are) not
*        displayed and the \ref CY_SEGLCD_EXCEED value is returned.
* \param display The pointer to the display structure \ref cy_stc_seglcd_disp_t.
* \return \ref cy_en_seglcd_status_t.
*
* \funcusage
* \snippet seglcd/snippet/SegLCD_Snpt.h snippet_Cy_SegLCD_BarLength
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_BarGraphDisplay
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_BarGraphValue
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_BarGraph
*
*******************************************************************************/
cy_en_seglcd_status_t Cy_SegLCD_BarGraph(LCD_Type * base,
                                         uint32_t   value,
                                         uint32_t   position,
                       cy_stc_seglcd_disp_t const * display)
{
    uint32_t retVal = (uint32_t)CY_SEGLCD_BAD_PARAM;

    if (CY_SEGLCD_IS_BARGRAPH(display, position)) /* If the display is bar graph / dial */
    {
        uint32_t i;
        retVal = (uint32_t)CY_SEGLCD_SUCCESS;

        for (i = position; i < display->symNum; i++)
        {
            retVal |= (uint32_t)Cy_SegLCD_WritePixel(base, *(display->pixMap + i), i < (position + value));
        }

        if (((uint32_t)CY_SEGLCD_BAD_PIXEL != retVal) && ((position + value) > display->symNum))
        {
            retVal |= (uint32_t)CY_SEGLCD_EXCEED;
        }
    }

    return((cy_en_seglcd_status_t)retVal);
}
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3');

#endif /* CY_IP_MXLCD */

/* [] END OF FILE */
